{"class_name": "Model", "keras_version": "2.0.6", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "int64", "batch_input_shape": [null, 26, 102], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "int64", "batch_input_shape": [null, 102], "name": "input_2", "sparse": false}, "name": "input_2"}, {"class_name": "Lambda", "inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"function": ["c\u0002\u0000\u0000\u0000\u0002\u0000\u0000\u0000\n\u0000\u0000\u0000C\u0000\u0000\u0000s+\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000t\u0000\u0000j\u0002\u0000|\u0000\u0000|\u0001\u0000d\u0001\u0000d\u0002\u0000d\u0003\u0000d\u0004\u0000d\u0005\u0000d\u0006\u0000\u0083\u0002\u0003\u0083\u0001\u0000S(\u0007\u0000\u0000\u0000Nt\b\u0000\u0000\u0000on_valuei\u0001\u0000\u0000\u0000t\t\u0000\u0000\u0000off_valuei\u0000\u0000\u0000\u0000t\u0004\u0000\u0000\u0000axisi\u00ff\u00ff\u00ff\u00ff(\u0003\u0000\u0000\u0000t\u0002\u0000\u0000\u0000tft\b\u0000\u0000\u0000to_floatt\u0007\u0000\u0000\u0000one_hot(\u0002\u0000\u0000\u0000t\u0001\u0000\u0000\u0000xt\u0002\u0000\u0000\u0000sz(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s \u0000\u0000\u0000../codesmell-rnn-extra-conv1d.pyt\b\u0000\u0000\u0000binarize\u0089\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0002", [97], null], "name": "lambda_1", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": ["c\u0002\u0000\u0000\u0000\u0002\u0000\u0000\u0000\u0003\u0000\u0000\u0000C\u0000\u0000\u0000s\u0015\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u0019|\u0000\u0000d\u0002\u0000\u0019|\u0001\u0000f\u0003\u0000S(\u0003\u0000\u0000\u0000Ni\u0000\u0000\u0000\u0000i\u0001\u0000\u0000\u0000(\u0000\u0000\u0000\u0000(\u0002\u0000\u0000\u0000t\b\u0000\u0000\u0000in_shapet\u0002\u0000\u0000\u0000sz(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s \u0000\u0000\u0000../codesmell-rnn-extra-conv1d.pyt\u0011\u0000\u0000\u0000binarize_outshape\u008d\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0001", [97], null], "output_shape_type": "lambda"}, "name": "lambda_1"}, {"class_name": "Conv1D", "inbound_nodes": [[["lambda_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 196, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [5]}, "name": "conv1d_1"}, {"class_name": "Dropout", "inbound_nodes": [[["conv1d_1", 0, 0, {}]]], "config": {"rate": 0.1, "trainable": true, "name": "dropout_1"}, "name": "dropout_1"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_1", "pool_size": [2]}, "name": "max_pooling1d_1"}, {"class_name": "Conv1D", "inbound_nodes": [[["max_pooling1d_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 196, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "name": "conv1d_2"}, {"class_name": "Dropout", "inbound_nodes": [[["conv1d_2", 0, 0, {}]]], "config": {"rate": 0.1, "trainable": true, "name": "dropout_2"}, "name": "dropout_2"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_2", "pool_size": [2]}, "name": "max_pooling1d_2"}, {"class_name": "Conv1D", "inbound_nodes": [[["max_pooling1d_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 196, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "name": "conv1d_3"}, {"class_name": "Dropout", "inbound_nodes": [[["conv1d_3", 0, 0, {}]]], "config": {"rate": 0.1, "trainable": true, "name": "dropout_3"}, "name": "dropout_3"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_3", "pool_size": [2]}, "name": "max_pooling1d_3"}, {"class_name": "Bidirectional", "inbound_nodes": [[["max_pooling1d_3", 0, 0, {}]]], "config": {"merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "unit_forget_bias": true, "dropout": 0.15, "recurrent_dropout": 0.15, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "stateful": false, "activity_regularizer": null, "recurrent_regularizer": null, "name": "lstm_1", "bias_constraint": null, "go_backwards": false, "implementation": 0, "kernel_regularizer": null, "return_sequences": false, "recurrent_constraint": null}}, "trainable": true, "name": "bidirectional_1"}, "name": "bidirectional_1"}, {"class_name": "Dropout", "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]], "config": {"rate": 0.3, "trainable": true, "name": "dropout_4"}, "name": "dropout_4"}], "input_layers": [["input_2", 0, 0]], "name": "model_1", "output_layers": [["dropout_4", 0, 0]]}}, "trainable": true, "name": "time_distributed_1"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "time_distributed_1"}, {"class_name": "Bidirectional", "config": {"merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.15, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "dropout": 0.15, "stateful": false, "recurrent_regularizer": null, "name": "lstm_2", "bias_constraint": null, "go_backwards": false, "implementation": 0, "kernel_regularizer": null, "return_sequences": false, "recurrent_constraint": null}}, "trainable": true, "name": "bidirectional_2"}, "inbound_nodes": [[["time_distributed_1", 0, 0, {}]]], "name": "bidirectional_2"}, {"class_name": "Dropout", "config": {"rate": 0.3, "trainable": true, "name": "dropout_5"}, "inbound_nodes": [[["bidirectional_2", 0, 0, {}]]], "name": "dropout_5"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dropout_5", 0, 0, {}]]], "name": "dense_1"}, {"class_name": "Dropout", "config": {"rate": 0.3, "trainable": true, "name": "dropout_6"}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dropout_6"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dropout_6", 0, 0, {}]]], "name": "dense_2"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]], "name": "model_2"}, "backend": "tensorflow"}